conda install pandas-datareader

In [1]:
import pandas as pd
import datetime as dt
from pandas_datareader import data

In [4]:
company = "MSFT"
start = "2010-01-01"
end = "2017-12-31"
stocks = data.DataReader(name = company, data_source= "yahoo", start= start, end= end)
stocks.head()

                 High        Low       Open      Close      Volume  Adj Close
Date
2009-12-31  30.990000  30.480000  30.980000  30.480000  31929700.0  24.152580
2010-01-04  31.100000  30.590000  30.620001  30.950001  38409100.0  24.525019
2010-01-05  31.100000  30.639999  30.850000  30.959999  49749600.0  24.532942
2010-01-06  31.080000  30.520000  30.879999  30.770000  58182400.0  24.382378
2010-01-07  30.700001  30.190001  30.629999  30.450001  50559700.0  24.128809

In [8]:
stocks.values
stocks.columns
stocks.index[0]
stocks.axes

[DatetimeIndex(['2009-12-31', '2010-01-04', '2010-01-05', '2010-01-06',
                '2010-01-07', '2010-01-08', '2010-01-11', '2010-01-12',
                '2010-01-13', '2010-01-14',
                ...
                '2017-12-15', '2017-12-18', '2017-12-19', '2017-12-20',
                '2017-12-21', '2017-12-22', '2017-12-26', '2017-12-27',
                '2017-12-28', '2017-12-29'],
               dtype='datetime64[ns]', name='Date', length=2014, freq=None),
 Index(['High', 'Low', 'Open', 'Close', 'Volume', 'Adj Close'], dtype='object')]

In [9]:
stocks.loc["2014-03-04"]

High         3.848000e+01
Low          3.807000e+01
Open         3.820000e+01
Close        3.841000e+01
Volume       2.680240e+07
Adj Close    3.404357e+01
Name: 2014-03-04 00:00:00, dtype: float64

In [11]:
stocks.iloc[300]

High         2.585000e+01
Low          2.536000e+01
Open         2.541000e+01
Close        2.568000e+01
Volume       4.990580e+07
Adj Close    2.089562e+01
Name: 2011-03-11 00:00:00, dtype: float64

In [12]:
stocks.loc["2013-10-01" : "2013-10-07"]

                 High        Low       Open      Close      Volume  Adj Close
Date
2013-10-01  33.610001  33.299999  33.349998  33.580002  36718700.0  29.318779
2013-10-02  34.029999  33.290001  33.360001  33.919998  46946800.0  29.615629
2013-10-03  34.000000  33.419998  33.880001  33.860001  38703800.0  29.563251
2013-10-04  33.990002  33.619999  33.689999  33.880001  33008100.0  29.580702
2013-10-07  33.709999  33.200001  33.599998  33.299999  35069300.0  29.074312

In [17]:
birthdays = pd.date_range(start = "1991-04-12", end = "2017-12-31", freq= pd.DateOffset(years = 1))
#this created datetime index of all of my birthdays

In [19]:
mask = stocks.index.isin(birthdays)

In [21]:
stocks.loc[mask]  #stock info on my birthday

                 High        Low       Open      Close      Volume  Adj Close
Date
2010-04-12  30.490000  30.209999  30.250000  30.320000  37068800.0  24.138147
2011-04-12  25.850000  25.549999  25.830000  25.639999  36920400.0  20.863073
2012-04-12  31.040001  30.420000  30.480000  30.980000  38304000.0  25.895206
2013-04-12  29.020000  28.660000  28.850000  28.790001  62886300.0  24.786921
2016-04-12  54.779999  53.759998  54.369999  54.650002  24574200.0  51.102345
2017-04-12  65.510002  65.110001  65.419998  65.230003  17108500.0  62.599735

In [22]:
stocks.head(3)

             High        Low       Open      Close      Volume  Adj Close
Date
2009-12-31  30.99  30.480000  30.980000  30.480000  31929700.0  24.152580
2010-01-04  31.10  30.590000  30.620001  30.950001  38409100.0  24.525019
2010-01-05  31.10  30.639999  30.850000  30.959999  49749600.0  24.532942

In [24]:
stocks.truncate(before= "2011-02-03", after= "2011-02-28")

                 High        Low       Open      Close      Volume  Adj Close
Date
2011-02-03  27.969999  27.540001  27.969999  27.650000  60340100.0  22.366400
2011-02-04  27.840000  27.510000  27.700001  27.770000  40412200.0  22.463465
2011-02-07  28.340000  27.790001  27.799999  28.200001  68980900.0  22.811296
2011-02-08  28.340000  28.049999  28.100000  28.280001  34904200.0  22.876007
2011-02-09  28.260000  27.910000  28.190001  27.969999  52905100.0  22.625250
2011-02-10  27.940001  27.290001  27.930000  27.500000  76672400.0  22.245062
2011-02-11  27.809999  27.070000  27.760000  27.250000  83939700.0  22.042831
2011-02-14  27.270000  26.950001  27.209999  27.230000  56766200.0  22.026653
2011-02-15  27.330000  26.950001  27.040001  26.959999  44116500.0  21.937143
2011-02-16  27.070000  26.600000  27.049999  27.020000  70817900.0  21.985968
2011-02-17  27.370001  26.910000  26.969999  27.209999  57207300.0  22.140572
2011-02-18  27.209999  26.990000  27.129999  27.059999  68667800.0  22.018515
2011-02-22  27.100000  26.520000  26.780001  26.590000  60889000.0  21.636082
2011-02-23  26.860001  26.430000  26.530001  26.590000  60234100.0  21.636082
2011-02-24  27.059999  26.500000  26.639999  26.770000  64494200.0  21.782545
2011-02-25  26.950001  26.500000  26.910000  26.549999  53006300.0  21.603535
2011-02-28  26.860001  26.510000  26.690001  26.580000  51379900.0  21.627945

In [32]:
newstocks = data.DataReader(name="GOOG", data_source= "yahoo", 
               start = dt.date(2008,1,1), end = dt.datetime.now())
newstocks.head(3)

,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,
2007-12-31,348.975250,343.058746,347.027924,343.505829,4783200.0,343.505829
2008-01-02,346.431793,336.675262,344.196320,340.381134,8669700.0,340.381134
2008-01-03,341.205780,336.074158,340.415924,340.450684,6547200.0,340.450684

In [31]:
newstocks.index + pd.DateOffset(days = 5)  #DateOffset = date increment

DatetimeIndex(['2008-01-05', '2008-01-07', '2008-01-08', '2008-01-09',
               '2008-01-12', '2008-01-13', '2008-01-14', '2008-01-15',
               '2008-01-16', '2008-01-19',
               ...
               '2019-06-11', '2019-06-12', '2019-06-15', '2019-06-16',
               '2019-06-17', '2019-06-18', '2019-06-19', '2019-06-22',
               '2019-06-23', '2019-06-24'],
              dtype='datetime64[ns]', name='Date', length=2887, freq=None)

In [34]:
newstocks.index + pd.DateOffset(weeks = 2)

DatetimeIndex(['2008-01-14', '2008-01-16', '2008-01-17', '2008-01-18',
               '2008-01-21', '2008-01-22', '2008-01-23', '2008-01-24',
               '2008-01-25', '2008-01-28',
               ...
               '2019-06-20', '2019-06-21', '2019-06-24', '2019-06-25',
               '2019-06-26', '2019-06-27', '2019-06-28', '2019-07-01',
               '2019-07-02', '2019-07-03'],
              dtype='datetime64[ns]', name='Date', length=2887, freq=None)

In [35]:
newstocks.index - pd.DateOffset(months = 3)

DatetimeIndex(['2007-09-30', '2007-10-02', '2007-10-03', '2007-10-04',
               '2007-10-07', '2007-10-08', '2007-10-09', '2007-10-10',
               '2007-10-11', '2007-10-14',
               ...
               '2019-03-06', '2019-03-07', '2019-03-10', '2019-03-11',
               '2019-03-12', '2019-03-13', '2019-03-14', '2019-03-17',
               '2019-03-18', '2019-03-19'],
              dtype='datetime64[ns]', name='Date', length=2887, freq=None)

In [36]:
newstocks.index - pd.DateOffset(years= 1, months = 3, days = 10)

DatetimeIndex(['2006-09-20', '2006-09-22', '2006-09-23', '2006-09-24',
               '2006-09-27', '2006-09-28', '2006-09-29', '2006-09-30',
               '2006-10-01', '2006-10-04',
               ...
               '2018-02-24', '2018-02-25', '2018-02-28', '2018-03-01',
               '2018-03-02', '2018-03-03', '2018-03-04', '2018-03-07',
               '2018-03-08', '2018-03-09'],
              dtype='datetime64[ns]', name='Date', length=2887, freq=None)

In [41]:
newstocks.head(3)

,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,
2007-12-31,348.975250,343.058746,347.027924,343.505829,4783200.0,343.505829
2008-01-02,346.431793,336.675262,344.196320,340.381134,8669700.0,340.381134
2008-01-03,341.205780,336.074158,340.415924,340.450684,6547200.0,340.450684

In [42]:
newstocks.index + pd.tseries.offsets.MonthEnd()

DatetimeIndex(['2008-01-31', '2008-01-31', '2008-01-31', '2008-01-31',
               '2008-01-31', '2008-01-31', '2008-01-31', '2008-01-31',
               '2008-01-31', '2008-01-31',
               ...
               '2019-06-30', '2019-06-30', '2019-06-30', '2019-06-30',
               '2019-06-30', '2019-06-30', '2019-06-30', '2019-06-30',
               '2019-06-30', '2019-06-30'],
              dtype='datetime64[ns]', name='Date', length=2887, freq=None)

In [43]:
newstocks.index + pd.tseries.offsets.MonthBegin()

DatetimeIndex(['2008-01-01', '2008-02-01', '2008-02-01', '2008-02-01',
               '2008-02-01', '2008-02-01', '2008-02-01', '2008-02-01',
               '2008-02-01', '2008-02-01',
               ...
               '2019-07-01', '2019-07-01', '2019-07-01', '2019-07-01',
               '2019-07-01', '2019-07-01', '2019-07-01', '2019-07-01',
               '2019-07-01', '2019-07-01'],
              dtype='datetime64[ns]', name='Date', length=2887, freq=None)

In [44]:
from pandas.tseries.offsets import *

In [46]:
newstocks.index + MonthBegin()

DatetimeIndex(['2008-01-01', '2008-02-01', '2008-02-01', '2008-02-01',
               '2008-02-01', '2008-02-01', '2008-02-01', '2008-02-01',
               '2008-02-01', '2008-02-01',
               ...
               '2019-07-01', '2019-07-01', '2019-07-01', '2019-07-01',
               '2019-07-01', '2019-07-01', '2019-07-01', '2019-07-01',
               '2019-07-01', '2019-07-01'],
              dtype='datetime64[ns]', name='Date', length=2887, freq=None)

In [48]:
newstocks.index + YearEnd()

DatetimeIndex(['2008-12-31', '2008-12-31', '2008-12-31', '2008-12-31',
               '2008-12-31', '2008-12-31', '2008-12-31', '2008-12-31',
               '2008-12-31', '2008-12-31',
               ...
               '2019-12-31', '2019-12-31', '2019-12-31', '2019-12-31',
               '2019-12-31', '2019-12-31', '2019-12-31', '2019-12-31',
               '2019-12-31', '2019-12-31'],
              dtype='datetime64[ns]', name='Date', length=2887, freq=None)

In [53]:
timeA = pd.Timestamp("2019-03-31 04:34:16 PM")
timeB = pd.Timestamp("2019-03-20 02:16:35 AM")

In [54]:
timeA - timeB

Timedelta('11 days 14:17:41')

In [55]:
timeB - timeA

Timedelta('-12 days +09:42:19')

In [61]:
pd.Timedelta(days = 3 , minutes = 45, weeks = 8) #note we cannot put years , alternatively we can do days 365* number

Timedelta('59 days 00:45:00')

In [66]:
pd.Timedelta("14 days 6 hours 5 minutes") # adding 2 weeks doesnt work

Timedelta('14 days 06:05:00')

In [72]:
pd.read_csv("pandas/ecommerce.csv", index_col="ID").head(15)

   order_date delivery_date
ID
1     5/24/98        2/5/99
2     4/22/92        3/6/98
4     2/10/91       8/26/92
5     7/21/92      11/20/97
7      9/2/93       6/10/98
8     6/10/93      11/11/93
9     1/25/90       10/2/94
10    2/23/92      12/30/98
11    7/12/96       7/14/97
18    6/18/95      10/13/97
19    5/10/98       5/19/98
20   10/17/92       10/6/98
23    5/30/92       8/15/99
26    4/11/96        5/4/98
30   10/22/98       1/11/99

In [74]:
shipping = pd.read_csv("pandas/ecommerce.csv", index_col="ID", parse_dates = ["order_date","delivery_date"])
shipping.head(15)

   order_date delivery_date
ID
1  1998-05-24    1999-02-05
2  1992-04-22    1998-03-06
4  1991-02-10    1992-08-26
5  1992-07-21    1997-11-20
7  1993-09-02    1998-06-10
8  1993-06-10    1993-11-11
9  1990-01-25    1994-10-02
10 1992-02-23    1998-12-30
11 1996-07-12    1997-07-14
18 1995-06-18    1997-10-13
19 1998-05-10    1998-05-19
20 1992-10-17    1998-10-06
23 1992-05-30    1999-08-15
26 1996-04-11    1998-05-04
30 1998-10-22    1999-01-11

In [76]:
shipping["Delivery Time"] = shipping["delivery_date"] - shipping["order_date"]

In [77]:
shipping.head(10)

   order_date delivery_date Delivery Time
ID
1  1998-05-24    1999-02-05      257 days
2  1992-04-22    1998-03-06     2144 days
4  1991-02-10    1992-08-26      563 days
5  1992-07-21    1997-11-20     1948 days
7  1993-09-02    1998-06-10     1742 days
8  1993-06-10    1993-11-11      154 days
9  1990-01-25    1994-10-02     1711 days
10 1992-02-23    1998-12-30     2502 days
11 1996-07-12    1997-07-14      367 days
18 1995-06-18    1997-10-13      848 days

In [81]:
shipping["Twice as Long"] = shipping["delivery_date"] + shipping["Delivery Time"]

In [82]:
shipping.head(5)

   order_date delivery_date Delivery Time Twice as Long
ID
1  1998-05-24    1999-02-05      257 days    1999-10-20
2  1992-04-22    1998-03-06     2144 days    2004-01-18
4  1991-02-10    1992-08-26      563 days    1994-03-12
5  1992-07-21    1997-11-20     1948 days    2003-03-22
7  1993-09-02    1998-06-10     1742 days    2003-03-18

In [83]:
shipping.dtypes

order_date        datetime64[ns]
delivery_date     datetime64[ns]
Delivery Time    timedelta64[ns]
Twice as Long     datetime64[ns]
dtype: object

In [86]:
mask1 = shipping["Delivery Time"] > "3000 days"  #panda figure out what I mean to say
shipping[mask1]

    order_date delivery_date Delivery Time Twice as Long
ID
32  1990-01-20    1998-07-24     3107 days    2007-01-25
130 1990-04-02    1999-08-16     3423 days    2008-12-29
151 1991-01-29    1999-08-05     3110 days    2008-02-09
229 1990-04-13    1998-11-17     3140 days    2007-06-23
314 1990-03-07    1999-12-25     3580 days    2009-10-13
331 1990-09-18    1999-12-19     3379 days    2009-03-20
348 1990-02-27    1999-01-04     3233 days    2007-11-11
392 1990-12-24    1999-12-04     3267 days    2008-11-13
590 1990-03-25    1998-12-20     3192 days    2007-09-16
634 1991-04-04    1999-07-21     3030 days    2007-11-06
674 1990-03-16    1998-12-28     3209 days    2007-10-11
760 1990-09-16    1998-12-06     3003 days    2007-02-25
764 1990-09-19    1999-09-16     3284 days    2008-09-12
786 1990-10-26    1999-05-10     3118 days    2007-11-22
884 1990-01-20    1999-11-12     3583 days    2009-09-03
902 1991-07-03    1999-11-10     3052 days    2008-03-19
904 1990-02-13    1999-11-15     3562 days    2009-08-16
943 1991-01-30    1999-12-02     3228 days    2008-10-03

In [87]:
shipping["Delivery Time"].min()

Timedelta('8 days 00:00:00')